[
  {
    "title": "Fund for Peace (FFP) 2025 Paid Remote Spring Internships",
    "description": "Are you passionate about conflict analysis, peacebuilding, and human rights? The Fund for Peace  FFP  is now accepting applications for its paid remote Spring 2025 internships, open to applicants from all nationalities. Running from January to May, this internship offers a unique opportunity to gain experience in conflict analysis, peacebuilding, and more, from anywhere in the world. Apply if you are interested in: Conflict Analysis Early Warning Peacebuilding Security Human Rights This internship is ideal for you, whether you re a graduate or undergraduate with significant, relevant experience. ",
    "datePublished": "2024-10-18T09:35:21+00:00",
    "url": "https://www.scholarshipair.com/scholarships/fund-for-peace-ffp-2025-paid-remote-spring-internships",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 31, 2024"
  },
  {
    "title": "Call For Applications: Aspire Coronation Trust (ACT) Foundation 2025 Grant Cycle for Organizations in Africa",
    "description": "Aspire Coronation Trust  ACT  Foundation is a grant making organization established in 2016 to support local, national and regional non – profit organizations working to address challenges and associated vulnerabilities across the African Continent. ACT Foundation seeks to promote broad based participation and partnership with other institutions and/or donor organizations aimed at building sustainable communities that provide innovative solutions to social, economic, and environmental challenges. They provide organizations with grants to ensure sustainable action in areas that align with our priority focus areas. We also guide our implementing partners through every step of the grant process so that they are not isolated. The focus areas include: Health: Malaria, cancer  breast, cervical, and prostate , maternal and child health Entrepreneurship: Vocational  education, skills acquisition, financial literacy, and inclusion Environment: Waste management, water, and sanitation Leadership: Youth leadership development, thought leadership Only projects within the four focus areas will be considered. ",
    "datePublished": "2024-10-18T09:18:40+00:00",
    "url": "https://www.scholarshipair.com/scholarships/call-for-applications-aspire-coronation-trust-act-foundation-2025-grant-cycle-for-organizations-in-africa",
    "applyLink": "#apply sec",
    "applicationDeadline": "November 3, 2024"
  },
  {
    "title": "Boustany Foundation MBA Scholarship at Cambridge University 2025",
    "description": "The Cambridge MBA is one of the world s leading business programmes, taught at one of the world s most prestigious universities. Scholarship recipients become members of Pembroke College, the third oldest and one of the most highly regarded colleges. The Boustany MBA Cambridge Scholarship is granted once every two years for a one year course at Cambridge University, Judge Business School. ",
    "datePublished": "2024-10-18T05:45:20+00:00",
    "url": "https://www.scholarshipair.com/scholarships/boustany-foundation-mba-scholarship-at-cambridge-university-2025",
    "applyLink": "#apply sec",
    "applicationDeadline": "May 15, 2025"
  },
  {
    "title": "Erasmus Mundus 2025 EMMIR Scholarship for International Students",
    "description": "The Erasmus Mundus EMMIR Scholarship is a 2 year Master s Degree program that is based on the First Semester in Germany, the Second Semester in Norway, the Third Semester is a research based Internship and the fourth Semester is dedicated to the thesis. The European Master in Migration and Intercultural Relations  EMMIR  is the first African European Asian Erasmus Mundus Master Course in migration studies and is jointly run by a consortium of three African, four European, and two Asian partner institutions, facilitated by a wider network of associate partners. EMMIR is a unique study programme focusing on migration through an intercultural approach. It equips students with profound theoretical and methodological skills in migration studies and allows them to conduct fieldwork primarily in African, Asian and European contexts. It is designed as a multidisciplinary two year master s programme  120 ECTS  that addresses important contemporary issues in a still emerging field of study. ",
    "datePublished": "2024-10-18T05:35:49+00:00",
    "url": "https://www.scholarshipair.com/scholarships/erasmus-mundus-2025-emmir-scholarship-for-international-students",
    "applyLink": "#apply sec",
    "applicationDeadline": "December 18, 2024"
  },
  {
    "title": "BOOST 2024 Undergraduate Scholarship for Nigerian Students",
    "description": "The Bolanle Olufolake Opeyokun Scholarship Trust provides educational scholarships to female students above the age of 16 years, who are Nigerian citizens looking to pursue undergraduate studies in any Nigerian university within the areas of Information and Computer Technology. ",
    "datePublished": "2024-10-18T05:22:45+00:00",
    "url": "https://www.scholarshipair.com/scholarships/boost-2024-undergraduate-scholarship-for-nigerian-students",
    "applyLink": "#apply sec",
    "applicationDeadline": "November 22, 2024"
  },
  {
    "title": "African Development Bank (AfDB0 2024 Fashionomics Africa Incubator and Accelerator Program",
    "description": "The African Development Bank Fashionomics Africa initiative s third online competition is offering $6,000 total in cash prizes, mentoring, new branding packages and other support for winning African designers of sustainable and circular fashion. Fashionomics Africa, in collaboration with the United Nations Environment Programme, Parsons School of Design, strategic consulting and communications agency BPCM, and the Ellen MacArthur Foundation, invites interested African fashion brands to apply to the sustainable fashion online competition. Entrants must pursue environmentally friendly measures, sustainability, and circular economy actions to qualify. The competition targets textile, apparel, and accessories entrepreneurs from Africa, aged 18 years or older, who have launched fashion businesses  up to a maximum of 50 employees , and whose sustainable designs have been produced within the last five years. Qualifying applicants will submit pictures of their products, detail their sustainable business model, and explain how their startup is environmentally friendly and innovative. ",
    "datePublished": "2024-10-17T19:12:42+00:00",
    "url": "https://www.scholarshipair.com/scholarships/african-development-bank-afdb0-2024-fashionomics-africa-incubator-and-accelerator-program",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 20, 2024"
  },
  {
    "title": "Trust for Sustainable Living (TSL) 2025 International Schools Essay and Debate Competition",
    "description": "Since our first competition was launched in 2010, we have received over 14,000 essay and video entries from 120 countries, exploring topics from sustainability education, protecting bio",
    "datePublished": "2024-10-17T18:51:13+00:00",
    "url": "https://www.scholarshipair.com/scholarships/trust-for-sustainable-living-tsl-2025-international-schools-essay-and-debate-competition",
    "applyLink": "#apply sec",
    "applicationDeadline": "March 3, 2025"
  },
  {
    "title": "Deutsche Welle (DW) 2025/2026 International Journalism Traineeship",
    "description": "The 18 month paid journalism program is considered one of the most prestigious of its kind in Germany – and beyond. It covers a range of fields and skills, such as TV moderation, multimedia storytelling, data journalism and working with AI tools. The topics are explored in seminars and workshops at DW s editorial offices in Bonn and Berlin, along with our regional bureaus across the globe. For the traineeship, DW is looking for open minded and critical thinking in",
    "datePublished": "2024-10-17T07:22:55+00:00",
    "url": "https://www.scholarshipair.com/scholarships/deutsche-welle-dw-2025-2026-international-journalism-traineeship",
    "applyLink": "#apply sec",
    "applicationDeadline": "November 18, 2024"
  },
  {
    "title": "African Development Bank (AfDB) 2024 Capacity Building Workshop for Higher Education Institutions (HEIs)",
    "description": "Welcome to the application form of the Capacity Building Workshop for Higher Education Institutions  HEIs , Enterprise Support Organisations within HEIs, Research Centres and Stakeholders in the HEIs entrepreneurship ecosystem in Africa. This training workshop is an initiative of the African Development Bank  AfDB  s Innovation and Entrepreneurship Lab  The Lab , with funding from the European Commission and the Swiss State Secretariat for Economic Affairs  SECO . The project titled:  Leveraging Research, STEM, Business Management and Training Capabilities of Higher Education Institutions  HEIs  and Research Centres for Strengthening Innovation and Entrepreneurship Ecosystem  aims to enhance the enterprise support activities of African HEIs by sharing best practices and successes within the African ecosystem and fostering collaboration across various regions in the continent. ",
    "datePublished": "2024-10-17T07:00:33+00:00",
    "url": "https://www.scholarshipair.com/scholarships/african-development-bank-afdb-2024-capacity-building-workshop-for-higher-education-institutions-heis",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 27, 2024"
  },
  {
    "title": "2025 Cambridge Africa Changemakers Scholarship at University of Cambridge",
    "description": "The Cambridge Africa Changemakers Scholarship is a programme of full cost scholarships for PhD students in any subject, open to candidates from any country in Africa. It is tenable at any college. It aims to provide support to talented students who require financial assistance to take up their places at the University, whose research research contributes to the development of the Continent and to climate resilient and sustainable futures for Africa and the world. ",
    "datePublished": "2024-10-17T06:15:13+00:00",
    "url": "https://www.scholarshipair.com/scholarships/2025-cambridge-africa-changemakers-scholarship-at-university-of-cambridge",
    "applyLink": "#apply sec",
    "applicationDeadline": "Not Specified"
  },
  {
    "title": "Federal Government 2024 Presidential CNG Initiative (Distribution of 2,000 Powered Tricycles)",
    "description": "In line with the President s Renewed Hope Agenda, this initiative reflects President Bola Ahmed Tinubu s unwavering commitment to empowering Nigerians, particularly the youth. Through innovative programs like the Presidential CNG Initiative, we are laying the foundation for a sustainable, self reliant future by lowering transportation costs, creating jobs, and promoting clean energy solutions. The distribution of 2,000 CNG powered tricycles is a significant step toward achieving economic growth and environmental responsibility, as envisioned in the Renewed Hope Agenda. This initiative also underscores the government s dedication to reducing the cost of living for everyday Nigerians while simultaneously fostering entrepreneurship. By transitioning the transport sector to Compressed Natural Gas  CNG , we aim to create a greener, more affordable public transportation system. This program is a testament to the administration s focus on job creation, sustainable development, and youth empowerment, ensuring that Nigeria s future is built on resilience, innovation, and shared prosperity. ",
    "datePublished": "2024-10-17T06:06:12+00:00",
    "url": "https://www.scholarshipair.com/scholarships/federal-government-2024-presidential-cng-initiative-distribution-of-2-000-powered-tricycles",
    "applyLink": "#apply sec",
    "applicationDeadline": "Not Specified"
  },
  {
    "title": "NITDA  2024 Cyber Security Training for Young Nigerians",
    "description": "NITDA wishes to invite applications from suitably qualified Nigerians who are interested to enroll in the Cyber Security Program. The campaign is aimed at marking Cyber Security Awareness month and collaborating with Cisco to train Nigerians to be safer and protected while on the cyber world by taking the unlisted courses as follows: Introduction to Cybersecurity Cyber Threat Management Endpoint Security Network Defense Ethical Hacker. This is according to the Agency s strategic vision for developing digital literacy skills and ensuring the penetration of such skills among Nigerians. ",
    "datePublished": "2024-10-17T05:55:13+00:00",
    "url": "https://www.scholarshipair.com/scholarships/nitda-2024-cyber-security-training-for-young-nigerians",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 22, 2024"
  },
  {
    "title": "LSETF/USADF 2024 Autogig Certified Foundation Training (ACFT) For Young Nigerians",
    "description": "The Lagos State Employment Trust Fund in partnership with USADF is organizing a free training in Autogig Certified Foundation Training  ACFT  For Young Nigerians and applications are being welcomed from qualified applicants. Ignite your future in Automotive Engineering. Join the 3 month Auto Foundation Technical Training Today. ",
    "datePublished": "2024-10-16T06:52:31+00:00",
    "url": "https://www.scholarshipair.com/scholarships/lsetf-usadf-2024-autogig-certified-foundation-training-acft-for-young-nigerians",
    "applyLink": "#apply sec",
    "applicationDeadline": "Not Specified"
  },
  {
    "title": "LSETF/USADF 2024 Employability Program (Preventive Health Managers)",
    "description": "The LSETF Employability Support Project, is designed to help tackle the unemployment scourge among the youths by helping them gain requisite knowledge and skill through vocational trainings and subsequently helping them get job placements. The first batch of youths which were trained at 8 vocational training centers across the state have graduated. ",
    "datePublished": "2024-10-16T06:44:02+00:00",
    "url": "https://www.scholarshipair.com/scholarships/lsetf-usadf-2024-employability-program-preventive-health-managers",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 17, 2024"
  },
  {
    "title": "Lagos State Employment Trust Fund (LSETF) Honey Treat Trade Academy (HTA) 2024 Construction Training Program",
    "description": "The Honeytreat Trade Academy  HTA  in partnership with Lagos State Employment Trust Fund  LSETF  is organizing a free training program in construction for artisans. Honeytreat Trade Academy  HTA  is a private indigenous institute that focuses on empowerment in skill acquisition within construction space to reduce the rate of unemployment in Nigeria. HTA is an institute driven with excellence in building competence and technological suaveness in construction trade. We engage Learners in intensive hand on practical training on construction trades like; Carpentry, Painting and Decorative Works, Masonry, Plumbing and Pipe Fitting, Electrical Wiring and Installation, Welding and Fabrication. All in line with National Skills Qualification level 1,2 and 3 scheme as supervised and powered by the Nigeria Institute of Building  NIOB . We are currently in partnership with BOSCH, NIOB, LSETF, to mention few. The following are the courses to be treated: Tiling and brickwork Woodwork and cabinet making Domestic water supply and waste management Domestic power supply and solar installation ",
    "datePublished": "2024-10-16T06:36:22+00:00",
    "url": "https://www.scholarshipair.com/scholarships/lagos-state-employment-trust-fund-lsetf-honey-treat-trade-academy-hta-2024-construction-training-program",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 22, 2024"
  },
  {
    "title": "University of Ottawa 2025 Undergraduate Scholarships for African Students",
    "description": "The University of Ottawa is thrilled to introduce the Entrance & Excellence Scholarships, a groundbreaking initiative aimed at supporting African students in pursuing higher education opportunities in Canada. This program offers eligible candidates a four year scholarship, effectively easing the financial burden associated with university tuition fees. The University of Ottawa takes immense pride in its",
    "datePublished": "2024-10-16T06:34:53+00:00",
    "url": "https://www.scholarshipair.com/scholarships/university-of-ottawa-2025-undergraduate-scholarships-for-african-students",
    "applyLink": "#apply sec",
    "applicationDeadline": "March 1, 2025"
  },
  {
    "title": "Odi-Olowo/Ojuwoye LCDA 2024 Free ICT Training For Young Nigerians",
    "description": "Our 4th Cohort of Free ICT Training propels you forward with targeted courses in Full Stack Web Development, Graphics & Animations, and Desktop Publishing, amplify your skills!!! ",
    "datePublished": "2024-10-16T06:12:42+00:00",
    "url": "https://www.scholarshipair.com/scholarships/odi-olowo-ojuwoye-lcda-2024-free-ict-training-for-young-nigerians",
    "applyLink": "#apply sec",
    "applicationDeadline": "October 20, 2024"
  },
  {
    "title": "US Government 2025 TechGirls Summer Exchange Program",
    "description": "TechGirls is a U.S. based summer exchange program designed to empower and support young women  ages 15 17  from the United States and select countries around the world to pursue higher education and careers in science, technology, engineering, and math  STEM  fields through hands on skills development training. The core of the TechGirls program is a 23 day experience in the United States. In partnership with Virginia Tech, participants engage in an interactive tech camp that provides an in depth examination of cutting edge technologies and various educational and professional paths in STEM fields. Then, TechGirls travel to a city around the USA  Austin, Cincinnati, Denver, Detroit, Kansas City, or Seattle  for community immersion and STEM career exploration. The TechGirls programming yields a multiplier effect as participants return home to conduct community based projects with seven months of mentorship. ",
    "datePublished": "2024-10-16T03:11:58+00:00",
    "url": "https://www.scholarshipair.com/scholarships/us-government-2025-techgirls-summer-exchange-program",
    "applyLink": "#apply sec",
    "applicationDeadline": "December 6, 2024"
  },
  {
    "title": "Sahara Group 2025 Graduate Management Trainee Program for Nigerian Graduates",
    "description": "The Sahara Group Graduate Management Trainee Program identifies and develops future leaders to drive Sahara Group s business growth aspirations. The Sahara Group GMT Program is a career boost for recent graduates and young professionals who have the potential and desire to become future leaders at Sahara. It s a 6 month program that combines theoretical business know how with practical application on the job. The program is largely experiential, focusing on developing meaningful and impactful skills. It includes foundational skills training, assignments and rotations, stretch projects, coaching, and mentoring—ultimately making you globally competitive. ",
    "datePublished": "2024-10-16T02:57:27+00:00",
    "url": "https://www.scholarshipair.com/scholarships/sahara-group-2024-graduate-management-trainee-program-for-nigerian-graduates",
    "applyLink": "#apply sec",
    "applicationDeadline": "Not Specified"
  },
  {
    "title": "UBA Foundation 2024 National Essay Competition for Nigerian Students (7.5 Million Naira in Prizes)",
    "description": "The National Essay Competition, targeted at senior secondary students in Nigeria, is organised annually, as part of UBA Foundation s education initiative which aims to promote the reading culture and encourage healthy and intellectual competition amongst secondary school students in Nigeria and across Africa. Essay Topic: The Impact of Carbon Emission on Climate Change in Nigeria: Discuss the Challenges and Profer Solutions ",
    "datePublished": "2024-10-16T02:51:20+00:00",
    "url": "https://www.scholarshipair.com/scholarships/uba-foundation-2025-national-essay-competition-for-nigerian-students-7-5-million-naira-in-prizes",
    "applyLink": "#apply sec",
    "applicationDeadline": "November 8, 2024"
  }
]
